import profile from 'asset/Pictures/Icons/profileplus.png';
import docSearch from 'asset/Pictures/Icons/docSearch.png';
import chart from 'asset/Pictures/Icons/chart.png';
import godarzi from 'asset/Pictures/Memebers/godarzi.JPG';
import drafshan from 'asset/Pictures/Memebers/drafshan.JPG';
import khanki from 'asset/Pictures/Memebers/khanki.JPG';
import moanjemi from 'asset/Pictures/Memebers/moanjemi.JPG';
import ebrahimipor from 'asset/Pictures/Memebers/ebrahimipor.jpeg';
// import person from 'asset/Pictures/Icons/personIcon.png';

export const BoardMember = [
  {
    name: 'محمد گودرزی ',
    pic: godarzi,
    posotion: 'مدیر عامل',
    WorkHistory: [
      'مدیر عامل و عضو هیات مدیره کارگزاری بانک شهر ',
      'مدیرعامل و نایب رئیس هیات مدیره کارگزاری خلیج فارس (آریانوین)',
      'قائم مقام مدیر عامل کارگزاری بانک صنعت و معدن '
    ]
  },
  {
    name: 'محمود درافشان:',
    pic: drafshan,
    posotion: 'عضو موظف هیات مدیره ',
    WorkHistory: [
      'عضو موظف هیات مدیره و معاونت کالا، انرژی و مشتقه کارگزاری شهر',
      'عضو کارگروه ابزارهای مشتقه مبتنی بر اوراق بهادار کانون کارگزاران بورس اوراق بهادار',
      'عضو کارگروه ابزارهای نوین مالی کانون کارگزاران بورس اوراق بهادار',
      'مدیر واحد کالا، انرژی و مشتقه شرکت کارگزاری حافظ'
    ]
  },
  {
    name: 'علی محمد خانکی ',
    pic: khanki,
    posotion: 'رییس هیات مدیره ',
    WorkHistory: [
      'مدیر مالی و خزانه داری بانک شهر ',
      'رییس هیات مدیره کارگزاری شهر ',
      'عضو هیات مدیره تامین سرمایه تمدن '
    ]
  },
  {
    name: 'آرش منجمی',
    pic: moanjemi,
    posotion: 'نایب رییس هیات مدیره ',
    WorkHistory: [
      'مدیرعامل و نایب رئیس هیات مدیره شرکت گنجینه آتیه کیش ',
      'مدیرعامل و نایب رییس هیات مدیره شرکت تجارت بین الملل شهر پویا ',
      'نایب رییس هیات مدیره کارگزاری شهر ',
      'رئیس هیات مدیره شرکت توسعه رفاه شهر '
    ]
  },
  {
    name: 'فرهاد ابراهیمی پور',
    pic: ebrahimipor,
    posotion: 'عضو هیات مدیره ',
    WorkHistory: [
      'مدیر امور شرکت ها و مجامع بانک شهر ',
      'عضو هیات مدیره کارگزاری شهر ',
      'مدیر فنی مؤسسه حسابرسی بهمند ',
      'حسابرس ارشد اداره کل حسابداری شهرداری تهران '
    ]
  }
];

export const executeMemebers = [
  {
    name: 'حامد حاتمی',
    posotion: 'مدیر اجرایی',
    WorkHistory: [
      'مدیر سرمایه گذاری کارگزاری شهر – تیر 1404 تا کنون ',
      'مدیر تامین مالی سبدگردان بها بازار پارس – فروردین 1404 تا خرداد 1404 ',
      'مدیر سرمایه گذاری ایران خودرو دیزل- اردیبهشت 1401 تا اسفند 1403',
      'مدیر سرمایه گذاری بیمه سرمد – مهر 1399 تا اسفند 1400'
    ]
  },
  {
    name: 'سارا منیعی',
    posotion: 'مسئول مالی',
    WorkHistory: [
      'رئیس حسابداری کارگزاری شهر – از خرداد 1403 تا کنون ',
      'رئیس حسابداری کارگزاری کالای خاورمیانه – از مهر 1400 تا اردیبهشت 1403',
      'کارشناس ارشد مالی کارگزاری بانک کشاورزی- از مهر 1399 تا شهریور 1400',
      'کارشناس ارشد مالی کارگزاری شهر – از آبان 1394 تا شهریور 1399'
    ]
  },
  {
    name: 'آراس صابر',
    posotion: 'مسئول فنی',
    WorkHistory: [
      'مدیر فناوری اطلاعات کارگزاری شهر - مهر 1400 تا کنون ',
      'مدیر فناوری اطلاعات شرکت ماهان اندیش آروین- فروردین 1399 تا شهریور 1400 ',
      'مدیر فناوری اطلاعات کارگزاری نهایت نگر – مهر 1390 تا اسفند 1398 ',
      'مدیر فناوری اطلاعات شرکت دیهیم دماوند – دی 1386 تا اسفند 1388'
    ]
  },
  {
    name: 'فاطمه ایمانی ',
    posotion: 'کارشناس تحلیل و سرمایه‌گذاری',
    WorkHistory: [
      'کارشناس تحلیل و سرمایه گذاری کارگزاری شهر –آذر 1403 تا کنون',
      'کارشناس تحلیل و سرمایه گذاری سبدگردان نجم –  مرداد 1402 تا آذر 1403'
    ]
  },
  {
    name: 'زهرا امیری داویجانی',
    posotion: 'کارشناس ریسک',
    WorkHistory: [
      'کارشناس تحلیل و سرمایه گذاری کارگزاری شهر- فروردین 1404 تا کنون ',
      'کارشناس تحلیل و سرمایه گذاری سبدگردان میلاد شهر – شهریور 1402 تا اسفند 1403'
    ]
  },
  {
    name: 'بهروز اردوبادی',
    posotion: 'کارشناس بازاریابی',
    WorkHistory: ['کارشناس پذیرش و بازاریابی کارگزاری شهر – تیر 1397 تا کنون ']
  },
  {
    name: 'محمد جواد اسدی',
    posotion: 'مشاور حقوقی',
    WorkHistory: [
      'کارشناس ارشد حقوق خصوصی ',
      'وکیل پایه یک دادگشتری ',
      'مشاور حقوی سپرده گذاری مرکزی ',
      'مشاور حقوقی شرکت کارگزاری های: مبین سرمایه – بانک رفاه – بانک کشاورزی- بانک صنعت و معدن – بانک ملت – بانک آینده'
    ]
  }
];

export const registrationInfo = [
  { title: 'نام شرکت', data: 'کارگزاری شهر' },
  { title: 'نوع شحصیت حقوقی', data: ' سهامی خاص' },
  { title: 'شماره اقتصادی', data: '411356349859' },
  { title: 'شناسه ملی', data: '10104008822' },
  { title: 'شماره ثبت نزد سازمان به عنوان نهاد مالی', data: '353410' },
  { title: 'تاریخ تاسیس شرکت ', data: '1388/05/04' }
];

export const advertismentData = [
  {
    text: 'ارائه مسیر سریع، شفاف و مقرون‌به‌صرفه برای جذب سرمایه‌گذاران خرد و کلان؛',
    icon: profile
  },
  { text: 'پالایش دقیق طرح‌ها از نظر اقتصادی، حقوقی و اجرایی؛', icon: docSearch },
  { text: 'حمایت همه‌جانبه از کارآفرینان در مسیر رشد کسب‌وکار.', icon: chart }
];

export const BankAccountInfos = {
  bankName: 'بانک شهر',
  accountNumber: '4001005705557',
  branchName: 'آرژانتین الوند',
  iban: ' IR960610000004001005705557'
};
