import React from 'react';
import risk from 'asset/Pictures/Images/risk.png';

function Article3() {
  return (
    <div className="lg:w-[80%] w-[95%] flex flex-col items-center  justify-start  gap-y-6 p-5  text-gray-main text-base  ">
      <img src={risk} className="lg:w-[70%] w-[90%] rounded-lg  object-contain " />
      <span className=" text-justify pt-5 ">
        ریسک جز لاینفک سرمایه‌گذاری است و سرمایه‌گذاران باید در نظر داشته باشند که در صورت تحمل ریسک
        سرمایه‌گذاران بازده به دست می‌آورند و از این جمله می‌توان رابطه ای مستقیم بین ریسک و بازده
        تعریف نمود حال در خصوص ریسک مختص به سرمایه‌گذاری در تامین مالی جمعی باید موارد مهمی را در
        نظر گرفت و تصمیم درستی اتخاذ نمایند. تامین مالی جمعی یک نوع شیوه سرمایه گذاری نوین در
        بازارهای مالی استو در ایران کارگروه تامین مالی جمعی به عنوان بازو اجرایی سازمان بورس و اوراق
        بهادار مستقر در شرکت فرابورس ایران به عنوان نهاد قانون‌گذار این حوزه سعی در افشا و آگاه‌سازی
        سرمایه گذاران از ریسک‌های موجود در این نوع سرمایه‌گذاری دارد. در این مقاله سعی بر این است که
        به ریسک‌های موجود در تامین مالی جمعی بپردازیم:{' '}
      </span>
      <span className=" text-justify  ">
        ریسک نقدشوندگی: این نوع سرمایه گذاری در جهان بدون تضمین ارائه می‌گردد اما با توجه به شرایط
        اقتصاد کلان نهادهای قانون‌گذار ایران درخصوص این سرمایه‌گذاری الزام به معرفی و استفاده
        متقاضیان از تضامین و وثایق معتبر درخصوص این نوع سرمایه‌گذاری باعث کاهش این ریسک شده است اما
        باید در نظر داشت که همچنان این ریسک به عنوان مهمترین ریسک این نوع سرمایه‌گذاری مطرح می‌گردد.
        در مقالات آتی در خصوص این ریسک بیشتر صحبت می‌نماییم.
      </span>
      <span className=" text-justify  ">
        ریسک عدم موفقیت طرح: ریسک عدم موفقیت در کمپین های تامین مالی برای طرح‌‎ها مطرح می‌گردد این
        ریسک زمانی به وقوع میپیوندد که مبلغ درخواستی متقاضی برای پس از اعلام شروع جمع آوری توسط سکو
        و فرابورس تکمیل نگردد جهت پیش گیری از این ریسک سکو اجازه یکبار تمدید را در قرارداداز متقاضی
        اختیار می‌نماید اما همچنان از این ریسک به صورت کامل برطرف نمی‌گردد.{' '}
      </span>
      <span className=" text-justify  ">
        ریسک انحراف از برنامه: متقاضی سرمایه طی ارائه برنامه کسب و کار مدون از برنامه خود جهت مصارف
        تامین مالی پرده برداری می‌نماد و با توجه به فضای کسب و کار متقاضی وضعیت کلان اقتصادی و
        ریسک‌های قانونی و عملیاتی امکان محقق نشدن برنامه کسب و کار ارائه شده وجود دارد لذا با توجه
        به این که سرمایه‌گذاران این حوزه به عنوان مشارکت کنندگان در سود وزیان طرح می‌باشند وجود ریسک
        انحراق از برنامه و ورود متقاضی به زیان در اجرای طرح به عنوان ریسک مهمی مطرح می‌گردد
      </span>
      <span className=" text-justify  ">
        ریسک اقتصاد کلان: این ریسک با توجه به همه گیری و تحت تاثیر قراردادن کلیه ابعاد یک کشور بازار
        تامین مالی جمعی را تحت تاثیر قرار می‌دهد این امر همان گونه که به سایر بازارهای مالی اثر
        می‌گذارد بر این بازار تاثیر می‌گذارد و هم سرمایه‌گذاران و هم متقاضیان سرمایه متاثر از این
        تغییر می‌شوند.
      </span>
      <span className=" text-justify  ">
        ریسک افشای نادرست اطلاعات: این ریسک توسط متقاضی به سرمایه گذاران به صورت مستقیم وارد می‌گردد
        و متقاضی مسئول مستقیم افشای اطلاعت نادرست قلمداد می‌گردد و سکوی تامین مالی جمعی طی قرارداد
        عاملیات خود هیچ مسئو.لیتی در قبال افشای نادرست اطلاعات ندارد و این ریسک از جمله عوامل تاثیر
        گذار بر این نوع سرمایه گذاری است.
      </span>
      <span className=" text-justify  ">
        ریسک امنیت اطلاعات : ریسک امنیت اطلاعات به عنوان مسئله ای بیان می‌گردد که مستقیما سکو و
        درگاه تامین مالی جمعی را مورد اثر قرار می‌دهد باید در نظر داشت که نهادهای قانون ‌گذاری در پی
        کاهش این ریسک علاوه بر مستقر نمودن واحد پشتیبانی و. آی تی در ساختار سازمان هر سکو با ارائه
        گواهی نامه تست نفوذ پذیری از سکوی تامین مالی توسط پیمانکار بیرون سازمان سعی در کاهش این ریسک
        داردو حفظ اطلاعات من جمله اطلاعات کاربران از جمله خطوط قرمز سکوها و نهادهای
        قانون‌گذارمی‌باشد.
      </span>
    </div>
  );
}

export default Article3;
