import React from 'react';
import zareZade from 'asset/Pictures/Images/zarezade.png';

function Article1() {
  return (
    <div className="lg:w-[80%] w-[95%] flex flex-col items-center  justify-start  gap-y-6 p-5  text-gray-main text-base  ">
      <img src={zareZade} className="lg:w-[70%] w-[90%] rounded-lg  object-contain " />
      <span className=" text-justify pt-5 ">
        مدیر ابزارها و نهادهای مالی فرابورس ایران با تأکید بر ریسک‌های موجود در طرح‌های تأمین مالی
        جمعی (کرادفاندینگ)، اعلام کرد که سرمایه‌گذاران این حوزه ملزم به مطالعه و تأیید بیانیه ریسک
        مختص هر طرح هستند.
      </span>
      <span className=" text-justify ">
        به گزارش مدیریت ارتباطات فرابورس ایران، میثم زارع‌زاده با اشاره به ماهیت سرمایه‌گذاری در
        کرادفاندینگ گفت: «سرمایه‌گذاران تأمین مالی جمعی، در سود و زیان طرح‌ها شریک هستند و به دلیل
        احتمال انحراف عملکرد طرح از پیش‌بینی‌ها، قبل از هرگونه سرمایه‌گذاری، باید بیانیه ریسک را
        مطالعه و تأیید کنند.
      </span>
      <span className=" text-justify ">
        وی کرادفاندینگ را یکی از ابزارهای نوین تأمین مالی برای توسعه کسب‌وکارها دانست و افزود: «با
        وجود مزایای این روش، سرمایه‌گذاری در مدل‌های بازده‌محور کرادفاندینگ، ریسک بالاتری نسبت به
        روش‌های ساختاریافته‌تر مانند صکوک دارد. سرمایه‌گذاران باید آگاه باشند که این روش، در کنار
        پتانسیل سودآوری بالا، چالش‌ها و ریسک‌های خاص خود را نیز دارد».
      </span>{' '}
      <span className=" text-justify ">
        زارع‌زاده همچنین بر اهمیت سواد مالی و درک ماهیت سرمایه‌گذاری در کرادفاندینگ تأکید کرد و گفت:
        «سرمایه‌گذاران باید با توجه به ویژگی‌های رفتاری خود، میزان ریسک‌پذیری و سطح آگاهی مالی،
        اقدام به سرمایه‌گذاری در این حوزه کنند تا بتوانند تصمیم‌گیری آگاهانه و منطقی داشته باشند».
      </span>
    </div>
  );
}

export default Article1;
