/* eslint-disable no-unused-vars */
import { Dialog, Transition } from '@headlessui/react';
import DataContext from 'comon/context/MainContext';
import Status from 'comon/GlobalyComponnetsUsed/Status';
import WorkHistory from 'pages/AboutUs/component/WorkHistory';
import BuyUnit from 'pages/BuyUnit/BuyUnit';
import RegisterFinancialReport from 'pages/RegisterFinancialReport/RegisterFinancialReport';
import RegisterPlan from 'pages/RegisterPlan/RegisterPlan';
import { Fragment, useContext } from 'react';
import mainlog from 'asset/Pictures/logo/CompanyMainLogo.svg';
import InlineSVG from 'react-inlinesvg';
import close from 'asset/Pictures/Icons/closeCircle.svg';

export default function GlobalyModal() {
  const { modal, setModal } = useContext(DataContext);

  const ComponentHandler = () => {
    switch (modal?.type) {
      case 'buyUnit':
        return <BuyUnit />;
      case 'failed':
        return <Status />;
      case 'success':
        return <Status />;
      case 'registerPlan':
        return <RegisterPlan />;
      case 'registerFinancialReport':
        return <RegisterFinancialReport />;
      case 'workHistory':
        return <WorkHistory data={modal?.data} />;
      case 'riskWarining':
        return (
          <div className=" flex flex-col justify-start items-center gap-y-5 bg-white p-5  lg:w-[50vw] w-[90vw] rounded-lg ">
            <div className="w-full flex justify-end items-center">
              <InlineSVG src={close} onClick={() => setModal()} className="cursor-pointer" />
            </div>
            <InlineSVG src={mainlog} className="w-auto h-[120px]" />
            <span className="w-full text-center font-bold text-base text-accent-600  ">
              بیانیه ریسک{' '}
            </span>
            <div
              dir="rtl"
              className="relative text-right max-h-[600px] overflow-y-auto text-sm font-light text-[#575555] w-full leading-[30px] lg:pb-10"
              style={{
                WebkitMaskImage:
                  'linear-gradient(0deg, rgba(255,255,255,0) 0%, #ffffff 14%, #ffffff 100%)',
                maskImage: 'linear-gradient(0deg, rgba(255,255,255,0) 0%, #ffffff 7%, #ffffff 100%)'
              }}>
              <p className="mb-4">
                سکوی تامین مالی جمعی شهر کراد به عنوان یک بستر تأمین مالی جمعی، امکان ارتباط میان
                صاحبان ایده و سرمایه‌گذاران را فراهم می‌کند. لازم است تمام کاربران اعم از
                سرمایه‌گذاران و مجریان طرح‌ها، با درک کامل از ریسک‌های ذاتی این نوع سرمایه‌گذاری
                اقدام نمایند. شهر کراد ضمن تلاش برای فراهم آوردن بستری امن، شفاف و منطبق بر الزامات
                قانونی، همواره بر این اصل تأکید دارد که مسئولیت نهایی تصمیم‌گیری برای سرمایه‌گذاری،
                بر عهده شخص سرمایه‌گذار بوده و آگاهی کامل از شرایط و ریسک‌ها، پیش‌نیاز ضروری هر
                اقدام سرمایه‌گذاری محسوب می‌شود.
              </p>

              <ol className="space-y-2 list-decimal pr-5">
                <li>
                  <strong> اهمیت تنوع‌بخشی در سبد سرمایه‌گذاری</strong>
                  <br />
                  برای کاهش ریسک کلی سرمایه‌گذاری، توصیه اکید می‌شود که سرمایه‌گذاری در طرح‌های شهر
                  کراد به‌عنوان بخشی از سبد متنوع سرمایه‌گذاری افراد در نظر گرفته شود، نه به‌عنوان
                  تنها محل سرمایه‌گذاری. تنوع در دارایی‌ها و پروژه‌ها می‌تواند نقش مهمی در کاهش
                  اثرگذاری ریسک‌های بالقوه و نوسانات مالی ایفا کند.
                </li>

                <li>
                  <strong> مسئولیت تصمیم‌گیری</strong>
                  <br />
                  مسئولیت نهایی تصمیم‌گیری برای سرمایه‌گذاری به طور کامل بر عهده سرمایه‌گذار است.
                  شهر کراد تنها بستری برای ارتباط فراهم می‌کند و هیچ‌گونه توصیه یا مشاوره
                  سرمایه‌گذاری ارائه نمی‌دهد.
                </li>

                <li>
                  <strong> نقدشوندگی</strong>
                  <br />
                  با توجه به اینکه بازار ثانویه جهت امکان فروش و یا نقل و انتقال گواهی شراکت توسط
                  فرابورس ایجاد نگردیده است، لذا سرمایه گذار می بایست گواهی شراکت خود را تا پایان
                  طرح نگهداری نماید و امکان نقد نمودن آن پیش از سررسید وجود ندارد. در صورت راه¬
                  اندازی بازار فوق توسط فرابورس امکان فروش و نقل و انتقال به وجود خواهد آمد.
                </li>

                <li>
                  <strong> پرداخت سود</strong>
                  <br />
                  طرح ¬ها هر کدام دارای زمانبندی متفاوت پرداخت سود می باشند. پرداخت علی¬ الحساب
                  سودها ممکن است ماهانه، دو ماه یکبار، سه ماه یکبار، شش ماه یکبار یا در سررسید یا
                  .... باشند. لذا سرمایه گذار می بایست در قسمت اطلاعات طرح به زمان¬بندی پرداخت سود
                  دقت نمایند.
                </li>

                <li>
                  <strong> عدم تحقق سود پیش بینی شده</strong>
                  <br />
                  سود اعلام‌شده برای هر طرح در سکوی شهر کراد بر مبنای پیش‌بینی‌های اعلامی سرمایه
                  پذیر و بررسی های کارشناسی اعلام می‌شود. با توجه به متغیر بودن شرایط اقتصادی،
                  عملیاتی و مدیریتی هر پروژه، احتمال عدم تحقق سود پیش‌بینی‌شده وجود دارد. پس از
                  اتمام دوره اجرای طرح، فرآیند حسابرسی صورت می‌گیرد و سود نهایی بر اساس عملکرد واقعی
                  طرح مشخص خواهد شد. سرمایه‌گذاران باید آگاه باشند که هیچ تضمینی برای دستیابی به سود
                  پیش‌بینی‌شده وجود ندارد.
                </li>

                <li>
                  <strong> ریسک اطلاعاتی</strong>
                  <br />
                  اطلاعات موجود در هر طرح توسط متقاضیان (سرمایه پذیران) ارائه می گردد. با وجود اینکه
                  این اطلاعات توسط تیم کارشناسی شهر کراد بررسی می شود، ممکن است در مواردی اطلاعات
                  ارائه شده توسط متقاضی کامل و دقیق نباشد.
                </li>
              </ol>

              <p className="">
                با پذیرش این شرایط، سرمایه گذاران و سرمایه پذیران تصدیق می‌کنند که از ریسک‌های موجود
                در سرمایه‌گذاری در پروژه‌های شهر کراد آگاه بوده و با علم و اراده خود اقدام به
                سرمایه‌گذاری یا جمع‌آوری سرمایه می‌نمایند.
              </p>

              <p className="">
                اقرارنامه و بیانیه پذیرش ریسک سرمایه‌گذاری در تامین مالی جمعی
                <br />
                «تامین مالی جمعی» به‌عنوان روشی برای سرمایه‌گذاری، مشابه سایر روش‌ها، متضمن
                ریسک‌هایی برای تامین‌کننده است و سکوی تامین مالی جمعی شهر کراد به‌عنوان عامل مجاز،
                برخی از خطرات این سرمایه‌گذاری را در اجرای مواد ۲۹ و ۳۰ «دستورالعمل تامین مالی
                جمعی»، به شرح زیر به اطلاع تامین‌کنندگان محترم می‌رساند:
              </p>

              <ol className="space-y-4 list-decimal pr-5">
                <li>
                  در تامین مالی جمعی، متقاضی با استفاده از وجوه، اقدام به راه‌اندازی و توسعه
                  کسب‌وکار اقتصادی برای تحصیل سود می‌نماید اما سودآوری طرح، قطعی نیست. علاوه بر این
                  از آن‌جا که متقاضیان و تامین‌کنندگان مستند به ماده ۲ «دستورالعمل تامین مالی جمعی»
                  در سود و زیان طرح‌ها شریک هستند، در صورت شکست یا انحراف طرح، احتمال ضرر یا از بین
                  رفتن سرمایه تامین‌کننده، وجود دارد. ضمناً در صورت انحراف برنامه کسب‌وکار متقاضی از
                  برنامه پیش‌بینی‌شده و نکول متقاضی در پرداخت، عامل در راستای حفظ منافع
                  تامین‌کنندگان و در چارچوب قراردادهای مربوط، اقدامات مقتضی را انجام مي‌دهد.
                </li>

                <li>
                  با توجه به نبود ضامن نقدشوندگی طی دوره (تا سررسید)، دسترسی به وجه سرمایه‌گذاری‌شده
                  پیش از موعد سررسید و نقل‌وانتقال گواهی شراکت آن جز در صورت تجویز مقررات و با رعایت
                  کلیه الزامات آن‌ها، وجود نخواهد داشت.
                </li>

                <li>
                  عامل در محدوده قوانین، مقررات و توافقات فی‌مابین، مسئول بررسی صحت اسناد و مدارک و
                  ارائه خدمات مربوط به تامین مالی جمعی است. به همین دلیل، در راستای اجرای ماده ۳۲
                  «دستورالعمل تامین مالی جمعی» عامل توصیه به سرمایه‌گذاری در هیچ طرح خاصی نخواهد
                  کرد. همچنین معرفی یا انتشار فراخوان طرح بدون اخذ نماد اختصاصی از فرابورس یا انجام
                  اقدامات مربوط برای تامین مالی جمعی خارج از سکو، ممنوع و بلااثر می‌باشد.
                </li>

                <li>
                  تامین مالی جمعی در بستر قوانین و مقررات مربوط انجام شده و کلیه ذی‌نفعان ملزم به
                  اطلاع و رعایت آن‌ها هستند. تغییرات قوانین و مقررات نافی علم و آگاهی سرمایه‌گذاران
                  نسبت به آن‌ها نبوده و نظارت کارگروه ارزیابی تامین مالی جمعی بر فرایند مربوط، سالب
                  مسئولیت تامین‌کنندگان در کسب آگاهی‌های مربوط و تعهد آن‌ها به پذیرش ریسک‌های مطرح
                  در سرمایه‌گذاری نخواهد بود.
                </li>

                <li>
                  اعطای مجوز فعالیت به عامل توسط کارگروه ارزیابی تامین مالی جمعی و فرابورس ایران به
                  منظور حصول اطمینان از رعایت قوانین و مقررات و شفافیت اطلاعاتی است. اعطای این
                  مجوزها به معنی نظارت تمام عیار بر تمامی متقاضیان و تامین‌کنندگان یا تایید مزایا و
                  تضمین سودآوری فعالیت‌های آن‌ها نبوده و هیچ‌یک از مجوزهای اعطاشده توسط فرابورس
                  ایران مبنی بر تایید طرحی خاص یا توصیه به سرمایه‌گذاری در آن نیست. کارگروه ارزیابی
                  تامین مالی جمعی و فرابورس ایران در خصوص ضرر و زیان ناشی از اتکا به تمام یا بخشی از
                  مندرجات اسناد و مدارک مربوط، از خود سلب مسئولیت می‌نماید.
                </li>

                <li>
                  اعلام ریسک‌های فوق به معنی سلب مسئولیت از عامل نبوده و از آن‌جا که عامل با اطلاع
                  از قوانین و مقررات مربوط در حدود تکالیف مقرراتی، قراردادی و حرفه‌ای خود اقدام به
                  فعالیت می‌نماید، در صورت قصور یا تقصیر از تکالیف مذکور، حسب مورد از حیث مدنی،
                  کیفری یا انضباطی مسئول خواهد بود. به هر ترتیب، سرمایه‌گذاران می¬توانند در صورت
                  مشاهده هر گونه تخلف از مقررات حاکم بر تامین مالی جمعی مراتب را با فرابورس ایران
                  مکاتبه نمایند.
                </li>
              </ol>

              <p className="">
                به‌موجب این سند، این‌جانب/ این شرکت .................... اقرارنامه و بیانیه ریسک
                سرمایه‌گذاری در تامین مالی جمعی را دریافت و مطالعه نموده و ضمن اعلام اطلاع از کلیه
                قوانین، مقررات و خصوصیات این‌گونه از سرمایه‌گذاری و ریسک‌هایی که در آن متصور می‌باشد
                (از جمله و نه محدود به ریسک‌های مورد اشاره در این سند) مراتب را تایید نموده و با علم
                به آن‌ها در این زمینه فعالیت می‌نماید.
              </p>
            </div>
          </div>
        );
      case 'privacyPolicy':
        return (
          <div className=" flex flex-col justify-start items-center gap-y-8 bg-white p-5  lg:w-[50vw] w-[90vw] rounded-lg ">
            <div className="w-full flex justify-end items-center">
              <InlineSVG src={close} onClick={() => setModal()} className="cursor-pointer" />
            </div>
            <InlineSVG src={mainlog} />
            <span className="w-full text-center font-bold text-base text-accent-600  ">
              سیاست محرمانگی
            </span>{' '}
            <div
              dir="rtl"
              className="relative text-right max-h-[700px] overflow-y-auto text-sm font-light text-[#575555] w-full leading-[30px] lg:pb-10"
              style={{
                WebkitMaskImage:
                  'linear-gradient(0deg, rgba(255,255,255,0) 0%, #ffffff 14%, #ffffff 100%)',
                maskImage:
                  'linear-gradient(0deg, rgba(255,255,255,0) 0%, #ffffff 10%, #ffffff 100%)'
              }}>
              <ol className="list-decimal pr-5 space-y-4">
                <li>
                  کاربران محترم شهرکراد؛ سکو برای ارائه بهتر و رعایت الزامات کارگروه تامین مالی جمعی
                  شرکت فرابورس ایران و برحسب خدمت از اطلاعات شخصی شما همچون نام و نام خانوادگی،
                  شماره تماس، کد ملی، ایمیل و ... را درخواست نماید.
                </li>
                <li>
                  شهرکراد جهت بروز رسانی اطلاعات سجام کاربران خود، شرایطی را محیا نموده تا با بروز
                  رسانی اطلاعات هویتی ثبت شده در سجام، سود سرمایه‌گذاری‌های خود به حساب تعریف شده در
                  سجام انتقال دهند.
                </li>
                <li>
                  شهرکراد برای بهبود تجربه کاربری، از «کوکی‌ها» استفاده کند. مرورگرهای اینترنت،
                  کوکی‌ها را برای پیگیری و گاهی ردگیری اطلاعات خاصی بر روی کامپیوتر کاربر ذخیره
                  می‌کنند. کاربران می‌توانند مرورگر خود را تنظیم کنند تا کوکی‌ها را ذخیره نکند و یا
                  در هنگام ذخیره هشدار دهد. اگر کاربر از این امکان استفاده کند ممکن است بخش‌هایی از
                  سایت به درستی عمل نکند.
                </li>
                <li>
                  شهرکراد برای جلوگیری از دسترسی بدون مجوز و غیرقانونی به اطلاعات وب‌سایت و کاربران
                  آن، اقدام‌های امنیتی را تا جایی که در توانش است، برقرار کرده‌ است و همواره امنیت
                  کاربران و اطلاعات آن‌ها از اولویت‌هایش است. با این وجود شهرکراد هیچ تضمینی را در
                  خصوص نفوذ غیرقانونی به سامانه‌هایش ارائه نمی‌دهد.
                </li>
                <li>
                  شهرکراد اطلاعات شخصی کاربران و بازدیدکنندگانش را به دیگران نفروخته و اجاره
                  نمی‌دهد. شهرکراد ممکن است از نرم‌افزارها و سرویس‌دهنده‌هایی برای ارائه خدمات به
                  کاربرانش استفاده کند. در این شرایط اطلاعات کاربران تحت نظارت وب‌سایت شهرکراد توسط
                  این سرویس‌ها و نرم‌افزارها استفاده خواهد شد.
                </li>
                <li>
                  شهرکراد اطلاعات کاربران را در پاسخ به درخواست احضاریه، درخواست دادگاه یا هر فرایند
                  قانونی مشابه دیگر، و یا دفاع از حقوق قانونی خود در برابر ادعاهای وارده ممکن است به
                  اشتراک بگذارد.
                </li>
              </ol>
              <p className="">
                تیم اجرایی شهرکراد با تمام همت خود در راستای شعار سازمانی خود &rdquo;زاگرس، نماد
                سرمایه‌گذاری&rdquo; سعی در محیا نمودن محیطی شفاف جهت سرمایه‌گذاری کاربران خود بکار
                خواهد گرفت. سکوی شهرکراد هر زمان که دچار تغییر در سیاست محرمانگی خود گردید آن را در
                همین صفحه اعلام می‌دارد.
              </p>

              <p className="mt-2 text-sm text-gray-600 font-bold ">مدیریت سکو</p>
              <p className="text-sm text-gray-600 mb-10 font-bold">تاریخ: ۱۴۰۴/۰۵/۰۵</p>
            </div>
          </div>
        );
      default:
        break;
    }
  };

  const isOpen = modal ? true : false;
  const closeModal = () => setModal();

  return (
    <>
      <Transition appear show={isOpen} as={Fragment}>
        <Dialog as="div" className="w-full relative z-[100000000] " onClose={closeModal}>
          <Transition.Child
            as={Fragment}
            enter="ease-out duration-300"
            enterFrom="opacity-100"
            enterTo="opacity-100"
            leave="ease-in duration-200"
            leaveFrom="opacity-100"
            leaveTo="opacity-0">
            <div className="relative inset-0 bg-black/25" />
          </Transition.Child>

          <div
            className="fixed inset-0 overflow-y-auto "
            style={{ backgroundColor: ' rgba(24, 24, 26, 0.5)' }}>
            <div className=" flex min-h-full  items-center justify-center   p-4 text-center">
              <Transition.Child
                as={Fragment}
                enter="ease-out duration-300"
                enterFrom="opacity-0 scale-95"
                enterTo="opacity-100 scale-100"
                leave="ease-in duration-200"
                leaveFrom="opacity-100 scale-100"
                leaveTo="opacity-0 scale-95">
                <Dialog.Panel className="lg:min-w-[30%] rounded-lg   max-w-[1440px] w-[95%] min-h-[500px] h-auto flex justify-start items-center flex-col transform   overflow-y-hidden  z-[10000]    align-middle  transition-all">
                  {ComponentHandler()}
                </Dialog.Panel>
              </Transition.Child>
            </div>
          </div>
        </Dialog>
      </Transition>
    </>
  );
}
