/* eslint-disable no-unused-vars */
import useDeviceDetection from 'comon/DeviceDetector/useDeviceDetection';
import React, { useContext, useState } from 'react';
import getBaseUrl from 'comon/Axios/getBaseUrl';
import InlineSVG from 'react-inlinesvg';
import download from 'asset/Pictures/Icons/download.svg';
import DataContext from 'comon/context/MainContext';

function FirstRole({ setStep, data, file = false }) {
  const { userInfo } = useContext(DataContext);
  const [role, setRole] = useState({ firstRole: false, seccondRole: false });

  const handelCheck = (key) => {
    setRole((prev) => ({ ...prev, [key]: role?.[key] ? false : true }));
  };
  const isMobile = useDeviceDetection();
  const disabled = Boolean(role?.seccondRole) && Boolean(role?.firstRole);

  const path = file
    ? file?.find((item) => item?.type == 13)?.path
    : data?.financialStatements?.find((item) => item?.type == 13)?.path;

  console.log('file', userInfo);

  return (
    <div className="w-full flex flex-col justify-start items-center gap-y-2">
      <span className="w-full text-start font-bold text-base  ">
        اقرارنامه و بیانیه پذیرش ریسک سرمایه‌گذاری در تامین مالی جمعی
      </span>
      <div
        dir="rtl"
        className="relative text-right leading-relaxed max-h-[400px] overflow-y-auto w-full text-sm font-light text-[#787878]  lg:pb-10"
        style={{
          WebkitMaskImage:
            'linear-gradient(0deg, rgba(255,255,255,0) 0%, #ffffff 14%, #ffffff 100%)',
          maskImage: 'linear-gradient(0deg, rgba(255,255,255,0) 0%, #ffffff 7%, #ffffff 100%)'
        }}>
        <p className="mb-4">
          سکوی تامین مالی جمعی شهر کراد به عنوان یک بستر تأمین مالی جمعی، امکان ارتباط میان صاحبان
          ایده و سرمایه‌گذاران را فراهم می‌کند. لازم است تمام کاربران اعم از سرمایه‌گذاران و مجریان
          طرح‌ها، با درک کامل از ریسک‌های ذاتی این نوع سرمایه‌گذاری اقدام نمایند. شهر کراد ضمن تلاش
          برای فراهم آوردن بستری امن، شفاف و منطبق بر الزامات قانونی، همواره بر این اصل تأکید دارد
          که مسئولیت نهایی تصمیم‌گیری برای سرمایه‌گذاری، بر عهده شخص سرمایه‌گذار بوده و آگاهی کامل
          از شرایط و ریسک‌ها، پیش‌نیاز ضروری هر اقدام سرمایه‌گذاری محسوب می‌شود.
        </p>

        <ol className="space-y-2 list-decimal pr-5">
          <li>
            <strong> اهمیت تنوع‌بخشی در سبد سرمایه‌گذاری</strong>
            <br />
            برای کاهش ریسک کلی سرمایه‌گذاری، توصیه اکید می‌شود که سرمایه‌گذاری در طرح‌های شهر کراد
            به‌عنوان بخشی از سبد متنوع سرمایه‌گذاری افراد در نظر گرفته شود، نه به‌عنوان تنها محل
            سرمایه‌گذاری. تنوع در دارایی‌ها و پروژه‌ها می‌تواند نقش مهمی در کاهش اثرگذاری ریسک‌های
            بالقوه و نوسانات مالی ایفا کند.
          </li>

          <li>
            <strong> مسئولیت تصمیم‌گیری</strong>
            <br />
            مسئولیت نهایی تصمیم‌گیری برای سرمایه‌گذاری به طور کامل بر عهده سرمایه‌گذار است. شهر کراد
            تنها بستری برای ارتباط فراهم می‌کند و هیچ‌گونه توصیه یا مشاوره سرمایه‌گذاری ارائه
            نمی‌دهد.
          </li>

          <li>
            <strong> نقدشوندگی</strong>
            <br />
            با توجه به اینکه بازار ثانویه جهت امکان فروش و یا نقل و انتقال گواهی شراکت توسط فرابورس
            ایجاد نگردیده است، لذا سرمایه گذار می بایست گواهی شراکت خود را تا پایان طرح نگهداری
            نماید و امکان نقد نمودن آن پیش از سررسید وجود ندارد. در صورت راه¬ اندازی بازار فوق توسط
            فرابورس امکان فروش و نقل و انتقال به وجود خواهد آمد.
          </li>

          <li>
            <strong> پرداخت سود</strong>
            <br />
            طرح ¬ها هر کدام دارای زمانبندی متفاوت پرداخت سود می باشند. پرداخت علی¬ الحساب سودها ممکن
            است ماهانه، دو ماه یکبار، سه ماه یکبار، شش ماه یکبار یا در سررسید یا .... باشند. لذا
            سرمایه گذار می بایست در قسمت اطلاعات طرح به زمان¬بندی پرداخت سود دقت نمایند.
          </li>

          <li>
            <strong> عدم تحقق سود پیش بینی شده</strong>
            <br />
            سود اعلام‌شده برای هر طرح در سکوی شهر کراد بر مبنای پیش‌بینی‌های اعلامی سرمایه پذیر و
            بررسی های کارشناسی اعلام می‌شود. با توجه به متغیر بودن شرایط اقتصادی، عملیاتی و مدیریتی
            هر پروژه، احتمال عدم تحقق سود پیش‌بینی‌شده وجود دارد. پس از اتمام دوره اجرای طرح، فرآیند
            حسابرسی صورت می‌گیرد و سود نهایی بر اساس عملکرد واقعی طرح مشخص خواهد شد. سرمایه‌گذاران
            باید آگاه باشند که هیچ تضمینی برای دستیابی به سود پیش‌بینی‌شده وجود ندارد.
          </li>

          <li>
            <strong> ریسک اطلاعاتی</strong>
            <br />
            اطلاعات موجود در هر طرح توسط متقاضیان (سرمایه پذیران) ارائه می گردد. با وجود اینکه این
            اطلاعات توسط تیم کارشناسی شهر کراد بررسی می شود، ممکن است در مواردی اطلاعات ارائه شده
            توسط متقاضی کامل و دقیق نباشد.
          </li>
        </ol>

        <p className="">
          با پذیرش این شرایط، سرمایه گذاران و سرمایه پذیران تصدیق می‌کنند که از ریسک‌های موجود در
          سرمایه‌گذاری در پروژه‌های شهر کراد آگاه بوده و با علم و اراده خود اقدام به سرمایه‌گذاری یا
          جمع‌آوری سرمایه می‌نمایند.
        </p>

        <p className="">
          اقرارنامه و بیانیه پذیرش ریسک سرمایه‌گذاری در تامین مالی جمعی
          <br />
          «تامین مالی جمعی» به‌عنوان روشی برای سرمایه‌گذاری، مشابه سایر روش‌ها، متضمن ریسک‌هایی برای
          تامین‌کننده است و سکوی تامین مالی جمعی شهر کراد به‌عنوان عامل مجاز، برخی از خطرات این
          سرمایه‌گذاری را در اجرای مواد ۲۹ و ۳۰ «دستورالعمل تامین مالی جمعی»، به شرح زیر به اطلاع
          تامین‌کنندگان محترم می‌رساند:
        </p>

        <ol className="space-y-4 list-decimal pr-5">
          <li>
            در تامین مالی جمعی، متقاضی با استفاده از وجوه، اقدام به راه‌اندازی و توسعه کسب‌وکار
            اقتصادی برای تحصیل سود می‌نماید اما سودآوری طرح، قطعی نیست. علاوه بر این از آن‌جا که
            متقاضیان و تامین‌کنندگان مستند به ماده ۲ «دستورالعمل تامین مالی جمعی» در سود و زیان
            طرح‌ها شریک هستند، در صورت شکست یا انحراف طرح، احتمال ضرر یا از بین رفتن سرمایه
            تامین‌کننده، وجود دارد. ضمناً در صورت انحراف برنامه کسب‌وکار متقاضی از برنامه
            پیش‌بینی‌شده و نکول متقاضی در پرداخت، عامل در راستای حفظ منافع تامین‌کنندگان و در چارچوب
            قراردادهای مربوط، اقدامات مقتضی را انجام مي‌دهد.
          </li>

          <li>
            با توجه به نبود ضامن نقدشوندگی طی دوره (تا سررسید)، دسترسی به وجه سرمایه‌گذاری‌شده پیش
            از موعد سررسید و نقل‌وانتقال گواهی شراکت آن جز در صورت تجویز مقررات و با رعایت کلیه
            الزامات آن‌ها، وجود نخواهد داشت.
          </li>

          <li>
            عامل در محدوده قوانین، مقررات و توافقات فی‌مابین، مسئول بررسی صحت اسناد و مدارک و ارائه
            خدمات مربوط به تامین مالی جمعی است. به همین دلیل، در راستای اجرای ماده ۳۲ «دستورالعمل
            تامین مالی جمعی» عامل توصیه به سرمایه‌گذاری در هیچ طرح خاصی نخواهد کرد. همچنین معرفی یا
            انتشار فراخوان طرح بدون اخذ نماد اختصاصی از فرابورس یا انجام اقدامات مربوط برای تامین
            مالی جمعی خارج از سکو، ممنوع و بلااثر می‌باشد.
          </li>

          <li>
            تامین مالی جمعی در بستر قوانین و مقررات مربوط انجام شده و کلیه ذی‌نفعان ملزم به اطلاع و
            رعایت آن‌ها هستند. تغییرات قوانین و مقررات نافی علم و آگاهی سرمایه‌گذاران نسبت به آن‌ها
            نبوده و نظارت کارگروه ارزیابی تامین مالی جمعی بر فرایند مربوط، سالب مسئولیت
            تامین‌کنندگان در کسب آگاهی‌های مربوط و تعهد آن‌ها به پذیرش ریسک‌های مطرح در سرمایه‌گذاری
            نخواهد بود.
          </li>

          <li>
            اعطای مجوز فعالیت به عامل توسط کارگروه ارزیابی تامین مالی جمعی و فرابورس ایران به منظور
            حصول اطمینان از رعایت قوانین و مقررات و شفافیت اطلاعاتی است. اعطای این مجوزها به معنی
            نظارت تمام عیار بر تمامی متقاضیان و تامین‌کنندگان یا تایید مزایا و تضمین سودآوری
            فعالیت‌های آن‌ها نبوده و هیچ‌یک از مجوزهای اعطاشده توسط فرابورس ایران مبنی بر تایید طرحی
            خاص یا توصیه به سرمایه‌گذاری در آن نیست. کارگروه ارزیابی تامین مالی جمعی و فرابورس ایران
            در خصوص ضرر و زیان ناشی از اتکا به تمام یا بخشی از مندرجات اسناد و مدارک مربوط، از خود
            سلب مسئولیت می‌نماید.
          </li>

          <li>
            اعلام ریسک‌های فوق به معنی سلب مسئولیت از عامل نبوده و از آن‌جا که عامل با اطلاع از
            قوانین و مقررات مربوط در حدود تکالیف مقرراتی، قراردادی و حرفه‌ای خود اقدام به فعالیت
            می‌نماید، در صورت قصور یا تقصیر از تکالیف مذکور، حسب مورد از حیث مدنی، کیفری یا انضباطی
            مسئول خواهد بود. به هر ترتیب، سرمایه‌گذاران می¬توانند در صورت مشاهده هر گونه تخلف از
            مقررات حاکم بر تامین مالی جمعی مراتب را با فرابورس ایران مکاتبه نمایند.
          </li>
        </ol>

        <p className="">
          به‌موجب این سند، این‌جانب/ این شرکت{' '}
          <strong className="text-base font-medium px text-green-950">{userInfo?.title}</strong>{' '}
          اقرارنامه و بیانیه ریسک سرمایه‌گذاری در تامین مالی جمعی را دریافت و مطالعه نموده و ضمن
          اعلام اطلاع از کلیه قوانین، مقررات و خصوصیات این‌گونه از سرمایه‌گذاری و ریسک‌هایی که در آن
          متصور می‌باشد (از جمله و نه محدود به ریسک‌های مورد اشاره در این سند) مراتب را تایید نموده
          و با علم به آن‌ها در این زمینه فعالیت می‌نماید.
        </p>
      </div>

      <div className="w-full flex lg:flex-row flex-col   lg:items-center items-start h-auto gap-5 justify-between pt-3 ">
        <button
          disabled={!disabled}
          onClick={() => setStep('setamount')}
          className={`w-[115px] lg:h-[48px] h-[38px] bg-accent-1000 ${
            !disabled && ' opacity-60'
          } text-white text-sm font-medium rounded-md text-center flex justify-center items-center focus:outline-none focus:ring-0 focus:border-none`}>
          ادامه
        </button>
        <div className="lg:w-[50%] w-full flex flex-col  items-start lg:h-[48px] h-[38px] justify-between gap-y-2  ">
          {/* first role */}
          <div
            className=" w-full flex justify-start items-start gap-x-2 flex-nowrap cursor-pointer "
            onClick={() => handelCheck('firstRole')}>
            <input
              onClick={() => handelCheck('firstRole')}
              type="checkbox"
              checked={role?.firstRole}
              className="w-4 h-4 focus:outline-none focus:ring-0  text-[#364A87] border border-[#364A87] rounded-sm "
            />
            <span className="text-wrap text-gray-700 text-xs text-start ">
              اقرارنامه و بیانیه پذیرش ریسک سرمایه گذاری در تامین مالی جمعی{' '}
            </span>
          </div>
          {/* seccend role */}
          <div className=" w-full flex justify-start items-center gap-x-2 flex-nowrap cursor-pointer">
            <input
              onClick={() => handelCheck('seccondRole')}
              type="checkbox"
              checked={role?.seccondRole}
              className="w-4 h-4 focus:outline-none focus:ring-0  text-[#364A87] border border-[#364A87] rounded-sm "
            />
            <span className="text-nowrap flex justify-start items-start  flex-nowrap text-gray-700 text-xs">
              پذیرش مفاد
              <a
                rel="noreferrer"
                type="download"
                target="_blank"
                href={file && getBaseUrl() + '/' + path}
                className=" text-xs   text-end underline hover:text-accent-900 cursor-pointer ">
                قرارداد
              </a>{' '}
              با سرمایه‌گذار{' '}
            </span>
          </div>
        </div>
      </div>
    </div>
  );
}

export default FirstRole;
