export const roleTex = [
  { text: 'متغاضی تعهد می‌نماید مشمول ماده ۱۴۱ نباشد.', key: 1 },
  {
    text: 'متقاضی متهد است پیش‌از انتشار کمپین نسبت به واریز حداقل ۱۰ درصد از سرمایه مورد نیاز به شماره حساب اعلام شده از سوی عامل اقدام نماید.',
    key: 2
  },
  {
    text: 'متقاضی متهد می‌نماید هیچگونه بدهی غیرتجاری در شبکه بانکی نداشته باشد.',
    key: 3
  },
  {
    text: 'متقاضی متهد می‌نماید هیچگونه چک برگشتی نداشته باشد.',
    key: 4
  },
  {
    text: 'متقاضی متهد می‌نماید هیچ‌یک از اعضا هیات‌مدیره این شرکت ممنوع‌المعامله نباشند.',
    key: 5
  },
  {
    text: 'عامل این شرکت دارای هیچگونه سابفه کیفری نباشد.',
    key: 6
  },
  {
    text: 'متقاضی متعد می‌نماید هیچ‌گونه دعوای موثر عیله آن شرکت وجود ندارد.',
    key: 7
  }
];
