export const FAQEnum = [
  {
    question: 'تامین مالی جمعی چیست؟',
    answer:
      'تامین مالی جمعی یکنوع روش سرمایه گذاری در صنایع مختلف است که در فرآیندهای اجرایی آن دارای ۳ رکن اصلی یعنی سرمایه‌پذیر، سرمایه‌گذار و سایت تامین مالی جمعی می‌باشد.'
  },
  {
    question: 'سکوی تامین مالی جمعی چیست؟',
    answer:
      'درگاه اینترنتی این نوع سرمایه‌گذاری می‌باشد که مجوزات فعالیت آن توسط عامل از شرکت فرابورس ایران اخذ شده و تمامی فعالیت‌های این درگاه در رصد نهاد مالی آن عامل می‌باشد. سرمایه‌گذاران و سرمایه‌پذیران در این سایت اقدام به ثبت‌نام نموده و کاربران با سرمایه‌گذاری و رفع نیاز شرکت‌های مختلف از صنایع متفاوت از این نوع سرمایه‌گذاری منتفع می‌گردند.'
  },
  {
    question: 'شهرکراد در چه صنعتی تامین مالی می‌نماید؟',
    answer:
      'زاگرس محدودیتی در انتخاب صنعت تامین مالی خود ندارد اما با نگاهی به پیشنهادهای تیم سرمایه‌گذاری و بررسی‌های موشکافانه تیم ارزیاب خود سعی در انتخاب سرمایه‌پذیری مناسب از صنایع روز کشور دارد تا از پتانسیل‌های رشد صنعت برخوردار گردد. طرح‌های سکوی شهرکراد توسط تیم متخصص شهرکراد ارزیابی می‌گردد. لازم به ذکر است تمامی طرح‌ها دارای ضمانت معتبر بانکی می‌باشند.'
  },
  {
    question: 'چرا از طریق سکوی شهرکراد تامین مالی کنیم؟',
    answer:
      'تامین مالی همواره دارای هزینه‌های پنهان زیادی بوده است که در شهرکراد این هزینه به صورت دقیق محاسبه گردیده و در اختیار آن‌ها قرار داده خواهد شد. متقاضیان محترم با استفاده از پتانسیل‌های مختلف مشاوره‌ای کارگزاری شهر می‌توانند برنامه تنظیم‌شده تامین مالی خود را از کارگزاری تحویل گیرند.'
  },
  {
    question: 'اگر سؤالی داشته باشیم چگونه راهنمایی لازم را دریافت کنیم؟',
    answer:
      'شما می‌توانید در پایین صفحه نخست در بخش دسترسی‌های سریع و در قسمت تماس با ما، با شماره واحد مشتریان کارگزاری شهر در ارتباط باشید.'
  },
  {
    question: 'حداقل و حداکثر میزان سرمایه‌گذاری چقدر است؟',
    answer:
      'در این نوع سرمایه‌گذاری هم اشخاص حقیقی و هم اشخاص حقوقی قادر به سرمایه‌گذاری هستند. بنا به دستورالعمل تامین مالی جمعی، اشخاص حقیقی حداقل از ۱ میلیون تومان تا ۵٪ مبلغ درخواستی متقاضی سرمایه قادر به سرمایه‌گذاری هستند، اما اشخاص حقوقی می‌توانند تا ۱۰۰٪ مبلغ درخواستی متقاضی سرمایه را تامین نمایند.'
  },
  {
    question: 'آیا می‌توان در مورد طرح‌ها، مشورتی با شهرکراد داشت؟',
    answer:
      'شهرکراد، ارائه مشورت و پیشنهاد در خصوص انتخاب طرح‌ها را به سرمایه‌گذاران، مصداق بارز نقص منشور اخلاقی خود و مندرجات دستورالعمل تامین مالی جمعی شرکت فرابورس ایران می‌داند، اما همواره نهایت اهتمام خود را در رفع ابهامات و پاسخ‌گویی به سوالات سرمایه‌گذاران دریغ نخواهد کرد.'
  },
  {
    question: 'ضمانت مورد نیاز متقاضیان سرمایه شهرکراد چیست؟',
    answer:
      'شهرکراد علاوه بر برگزاری کمیته‌های سرمایه‌گذاری در خصوص انتخاب متقاضیان سرمایه واجد شرایط و تخصیص منابع مالی، در پی کاهش ریسک این نوع سرمایه‌گذاری سعی در دریافت ضمانت‌های معتبر شبکه بانکی و سایر صندوق‌های معتبر کشور از متقاضیان سرمایه را دارد.'
  },
  {
    question: 'سود پیش بینی شده حاصل از سرمایه‌گذاری چگونه به سرمایه‌گذار واریز می‌گردد؟',
    answer:
      'کاربران در شهرکراد با ثبت‌نام و فعال نمودن گزینه "مطالعه قوانین و مقررات" که به معنای پذیرش شروط شهرکراد در این نوع سرمایه‌گذاری می‌باشد، قراردادی مجازی مبنی بر مشارکت در این نوع سرمایه‌گذاری با شهرکراد عقد نموده و در پی این قرارداد، شهرکراد موظف به اخذ و پرداخت سودهای حاصل از سرمایه‌گذاری می‌باشد.'
  },
  {
    question: 'مواعد پرداخت سود پیش بینی شده حاصل از سرمایه‌گذاری چگونه است؟',
    answer:
      'بنا به قوانین و مقررات کارگروه تامین مالی جمعی شرکت فرابورس ایران، مواعد پرداخت سود پیش بینی شده پیش بینی شده به‌صورت هر سه ماه یک‌بار، پس از زمان واریز اصل سرمایه تجمیع شده توسط عامل به متقاضی سرمایه محاسبه گردیده و به سمع و نظر سرمایه‌گذاران آن طرح خواهد رسید.'
  },
  {
    question: 'امکان دستیابی سرمایه‌گذاران به اصل سرمایه در زمان دلخواه چگونه است؟',
    answer:
      'سرمایه‌گذاران محترم توجه داشته باشند که اصل سرمایه در این نوع سرمایه‌گذاری تا یک سال در اختیار متقاضی سرمایه بوده و قابلیت دستیابی به آن وجود ندارد. اما سود پیش بینی شده پیش بینی شده حاصله هر سه ماه یک‌بار بنا به تعهد متقاضی سرمایه دریافت می‌گردد.'
  },
  {
    question: 'سند شراکت در این نوع سرمایه‌گذاری چیست؟',
    answer:
      'در واقع گواهی شراکت یک نوع اوراق بهاداری است که به مشارکت سرمایه‌گذاران در طرح‌های تامین مالی جمعی تعلق می‌گیرد و به منزله مشارکت در طرح‌های تامین مالی بوده و از سوی شرکت فرابورس ایران به نام سرمایه‌گذار سجامی منتشر می‌گردد.'
  },
  {
    question: 'آیا سرمایه‌گذاری در شهرکراد قابلیت تغییر یا لغو را دارد؟',
    answer:
      'سرمایه‌گذاران محترم باید توجه داشته باشند پس از واریز سرمایه جهت تامین مالی طرح‌ها، امکان لغو وجود ندارد، اما امکان واریز مجدد سرمایه وجود دارد.'
  },
  {
    question: 'آیا می‌توان به صورت همزمان در چند طرح ثبت‌نام نمود؟',
    answer: 'بله، قابلیت انجام چند سرمایه‌گذاری در طرح‌های مختلف شهرکراد وجود دارد.'
  },
  {
    question: 'طرح‌های سرمایه‌گذاری را در کدام قسمت می‌توان مشاهده نمود؟',
    answer:
      'طرح‌های سرمایه‌گذاری‌شده مختص به هر سرمایه‌گذار را می‌توان در بخش "سرمایه‌گذاری‌ها" در پروفایل شخصی خود مشاهده نمود.'
  },
  {
    question: 'چارت سازمانی کراد چیست؟',
    answer: 'چارت سازمانی کراد در بخش دسترسی‌های سریع به‌عنوان تیم اجرایی مدنظر قرار گرفته است.'
  }
];
