/* eslint-disable no-irregular-whitespace */
export const investeeGuid = [
  {
    title: 'ثبت درخواست تامین مالی',
    description: `متقاضی می‌بایست درخواست تامین مالی و اطلاعات اولیه طرح خود را از طریق پنل کاربری در سکو ثبت نماید.
این نخستین گام برای ورود طرح به فرآیند تامین مالی جمعی در شهرکراد  است.`
  },
  {
    title: 'بررسی و اعتبارسنجی متقاضی',
    description: `در این مرحله اطلاعات هویتی، مالی و اعتباری شرکت متقاضی مطابق دستورالعمل‌های شرکت فرابورس ایران، توسط تیم تخصصی شهرکراد بررسی و تایید می‌شود.
هدف این ارزیابی اطمینان از صلاحیت متقاضی برای ورود به فرآیند تامین مالی جمعی است.
`
  },
  {
    title: 'ارزیابی تخصصی طرح',
    description: `در این مرحله، مدارک و مستندات طرح توسط تیم ارزیابی شهرکراد  دریافت و بررسی می‌شود.
کمیته تخصصی ارزیابی، طرح را از جنبه‌های مختلف از جمله امکان‌سنجی، قابلیت اجرا، پتانسیل سودآوری و میزان ریسک بررسی می‌کند تا تنها طرح‌های واجد شرایط وارد مرحله پذیرش شوند.`
  },
  {
    title: 'انعقاد قرارداد',
    description: `پس از تایید نهایی متقاضی و پذیزش طرح توسط شهرکراد ، قرارداد رسمی همکاری بین متقاضی و سکو منعقد می‌شود. این قرارداد چارچوب حقوقی اجرای طرح، تعهدات طرفین و نحوه تامین مالی از طریق سکو را مشخص می‌سازد.`
  },
  {
    title: 'دریافت نماد معاملاتی از فرابورس',
    description: `پس از عقد قرارداد، مدارک و مستندات طرح توسط شهرکراد  به شرکت فرابورس ایران ارسال شده و پس از طی فرآیندهای مربوطه، نماد معاملاتی اختصاصی برای طرح صادر می‌شود.
این نماد مجوز رسمی انتشار عمومی طرح در سکو است و با دریافت آن، فرآیند جذب سرمایه آغاز خواهد شد.`
  },
  {
    title: 'انتشار عمومی و آغاز جذب سرمایه‌',
    description: `با دریافت نماد معاملاتی، دوره جذب سرمایه در سکوی شهرکراد  آغاز می‌شود. در این مرحله، طرح شما روی سکو منتشر شده و به سرمایه‌گذاران معرفی می‌گردد.
شهرکراد  با همراهی تیم تخصصی، فرآیند جذب سرمایه را به صورت مستمر مدیریت و پیگیری می‌کند تا منابع مالی مورد نیاز طرح تامین شود.`
  },
  {
    title: 'تخصیص منابع و آغاز اجرای طرح',
    description: `پس از تکمیل موفق فرآیند جذب سرمایه، مبالغ جمع آوری شده توسط سکو، به حساب اعلام شده از سوی متقاضی منتقل می‌شود.
با واریز این مبلغ، طرح وارد مرحله اجرای عملیاتی می‌شود و تیم شهرکراد  نیز فرآیند نظارت و گزارش‌دهی را آغاز خواهد کرد.
`
  },
  {
    title: 'نظارت تخصصی و حمایت اجرایی',
    description: `با آغاز اجرای طرح، شهرکراد  روند پیشرفت آن را به صورت مستمر زیر نطر دارد. همچنین در این مرحله، گزارش‌های دوره‌ای از وضعیت اجرای طرح تهیه و در اختیار سرمایه‌گذاران قرار می‌گیرد.
در این مسیر، تیم شهرکراد  ضمن نظارت، همراه سرمایه‌پذیر نیز هست تا اجرای صحیح و موفق طرح را تسهیل و پشتیبانی نماید.`
  },
  {
    title: 'پایان طرح و تسویه',
    description: `
با پایان دوره اجرای طرح و انجام تعهدات، فرآیند تسویه نهایی توسط شهرکراد  انجام می‌شود. در نهایت تضامین ارائه‌شده آزاد و قرارداد همکاری میان سرمایه‌پذیر و سکو خاتمه می‌یابد. پایان این مسیر، آغاز اعتماد متقابل برای همکاری‌های آینده خواهد بود.`
  }
];

export const investorGuid = [
  {
    title: 'ثبت‌نام در سایت و احراز هویت',
    description: `در اولین گام، در پلتفرم شهرکراد  ثبت‌نام کنید تا حساب کاربری اختصاصی شما ایجاد شود.
با تکمیل فرآیند احراز هویت، دسترسی شما به جزئیات طرح‌ها فعال شده و امکان مشارکت در فرصت‌های سرمایه‌گذاری فراهم می‌شود.`
  },
  {
    title: 'بررسی و انتخاب فرصت سرمایه‌گذاری مناسب',
    description: `طرح‌هایی که در شهرکراد  منتشر می‌شوند، پیش از انتشار از چندین مرحله ارزیابی تخصصی عبور می‌کنند تا هم پایبندی شرکت‌ها به تعهدات‌شان سنجیده شود و هم ظرفیت واقعی طرح برای سودآوری بررسی گردد.
این ارزیابی‌ها به ما کمک می‌کند فرصت‌هایی متنوع ارائه دهیم تا پاسخ‌گوی نیازها و ترجیحات مختلف سرمایه‌گذاران باشد.
برای انتخاب بهتر، پیشنهاد می‌کنیم اطلاعات هر فرصت را با دقت مطالعه کنید و گزینه‌ای را انتخاب کنید که با اهداف مالی و سطح ریسک‌پذیری شما هم‌خوانی داشته باشد.`
  },
  {
    title: 'پذیرش قرارداد و بیانیه ریسک',
    description: `پیش از نهایی‌کردن سرمایه‌گذاری، لازم است مفاد قرارداد سرمایه‌گذاری و بیانیه ریسک را مطالعه کرده و تأیید نمایید.
این مرحله به‌منظور اطمینان از آگاهی کامل سرمایه‌گذاران از حقوق، تعهدات و ریسک‌های احتمالی هر طرح انجام می‌شود.
با تأیید این موارد، شما به‌صورت رسمی فرآیند سرمایه‌گذاری را آغاز می‌کنید.`
  },
  {
    title: 'واریز وجه',
    description: `پس از انتخاب طرح مورد نظر، می‌توانید مبلغ سرمایه‌گذاری خود را به حساب مشخص‌شده تحت نظارت شهرکراد  واریز کنید.
این فرآیند برای سرمایه‌گذاران حقیقی با رعایت محدودیت تعیین‌شده توسط فرابورس انجام می‌شود؛ به این معنا که هر فرد تنها می‌تواند حداکثر ۵٪ از کل سرمایه مورد نیاز هر طرح را تأمین کند.
برای مبالغ تا سقف ۲۰۰ میلیون تومان، امکان پرداخت آنلاین از طریق درگاه پرداخت وجود دارد.
در صورتی که مبلغ سرمایه‌گذاری شما بیش از این سقف باشد، می‌توانید از روش‌های حواله بانکی مانند پایا یا ساتنا استفاده کرده و تصویر رسید واریز را در پلتفرم بارگذاری نمایید.
توجه داشته باشید که واریز وجه تنها باید از حساب بانکی به نام سرمایه‌گذار انجام شود.`
  },
  {
    title: 'دریافت تاییدیه مشارکت',
    description: `پس از پایان دوره جذب سرمایه، تأییدیه رسمی مشارکت شما توسط شرکت فرابورس ایران صادر می‌شود.
این تأییدیه، سندی معتبر از ثبت موفق سرمایه‌گذاری شما در طرح مورد نظر است و در پنل کاربری‌تان در شهرکراد  قرار می‌گیرد.
شما می‌توانید در هر زمان، این تأییدیه را مشاهده و دانلود کنید.`
  },
  {
    title: 'آغاز اجرای طرح، با نظارت مستمر شهرکراد ',
    description: `با تکمیل فرآیند تأمین مالی، اجرای طرح توسط نهاد متقاضی آغاز می‌شود.
در این مرحله، تیم شهرکراد  روند اجرای طرح را به‌صورت منظم پایش می‌کند و گزارش‌های مربوط به پیشرفت طرح در اختیار سرمایه‌گذاران قرار می‌گیرد.
هدف ما، اطمینان از حسن اجرای تعهدات و حفظ شفافیت در کل مسیر سرمایه‌گذاری و پیشرفت پروژه است.`
  },
  {
    title: 'بازگشت سرمایه و پرداخت سود پیش بینی شده',
    description: `سود پیش بینی شده و اصل سرمایه شما، در موعدهای تعیین‌شده در جزئیات هر طرح، به حساب بانکی ثبت‌شده در سجام واریز خواهد شد.
در طول دوره سرمایه‌گذاری، تیم شهرکراد  با نظارت مستمر و گزارش‌دهی شفاف، روند اجرای طرح و وضعیت پرداخت‌ها را دنبال می‌کند.
شما نیز می‌توانید به‌راحتی از طریق پنل کاربری، روند و زمان‌بندی واریزها را پیگیری نمایید.`
  }
];

export const DetectUserType = (type) => (type == 'Investee' ? investeeGuid : investorGuid);
