import React from 'react';
import { useNavigate } from 'react-router-dom';
import keyword from 'asset/Pictures/Images/Keyword.png';
function CrowdfundingKeywords() {
  const navigate = useNavigate();

  return (
    <div
      dir="rtl"
      className=" text-right p-6 flex flex-col items-center  space-y-6 bg-white text-gray-800 leading-loose mt-28 py-10 w-full max-w-[1440px]  rounded-large  drop-shadow-md ">
      <div className="w-[95%] flex  justify-end items-center pt-5">
        {' '}
        <button
          onClick={() => navigate(-1)}
          className="drop-shadow-md rounded-md p-3  bg-white hover:border border-accent-300 ">
          {' '}
          بازگشت
        </button>
      </div>
      <h1 className="text-2xl font-bold text-accent-700 ">کلید واژهای تامین مالی جمعی:</h1>
      <img src={keyword} className="w-[90%] object-contain h-[300px]" />

      <dl className="space-y-4">
        <div>
          <dt className="font-bold text-accent-600">عامل:</dt>
          <dd>
            شخص حقوقی دارای مجوز تأمین مالی جمعی که این مجوز را از کارگروه تأمین مالی جمعی مستقر در
            شرکت فرابورس تهران دریافت کرده است. عامل وظیفه انتشار طرح‌های متقاضیان سرمایه و مدیریت
            فرآیند تأمین مالی را بر عهده دارد.
          </dd>
        </div>

        <div>
          <dt className="font-bold text-accent-600">کارگروه تأمین مالی جمعی:</dt>
          <dd>
            گروهی متشکل از اعضای سازمان بورس و اوراق بهادار که جلسات مربوط به تأمین مالی جمعی را در
            محل شرکت فرابورس تهران برگزار می‌کنند. این کارگروه دارای حق رأی برای تأیید و انتصاب
            عاملان واجد شرایط در این حوزه است.
          </dd>
        </div>

        <div>
          <dt className="font-bold text-accent-600">سکو یا پلتفرم تأمین مالی جمعی:</dt>
          <dd>
            وب‌سایت یا درگاه اینترنتی رسمی که به متقاضیان سرمایه امکان ارائه طرح‌های خود و به
            سرمایه‌گذاران امکان تأمین منابع مالی را می‌دهد. این سکوها به‌صورت مستقیم به سامانه
            فرابورس متصل هستند تا فرآیند جمع‌آوری وجوه به‌صورت شفاف انجام شود.
          </dd>
        </div>

        <div>
          <dt className="font-bold text-accent-600">نهاد مالی:</dt>
          <dd>
            شخص حقوقی دارای مجوز فعالیت در بازار سرمایه از سازمان بورس و اوراق بهادار که پس از
            تغییرات اساسنامه، مسئولیت صحت‌سنجی طرح‌های متقاضیان سرمایه و عاملان را بر عهده دارد. هر
            طرح قبل از سرمایه‌گذاری عمومی، باید به تأیید این نهاد مالی برسد.
          </dd>
        </div>

        <div>
          <dt className="font-bold text-accent-600">متقاضی سرمایه:</dt>
          <dd>
            شخص حقوقی که دارای مجوز فعالیت در حوزه مرتبط با طرح خود بوده و سابقه عملیاتی در آن صنعت
            دارد. این افراد یا شرکت‌ها برای تأمین نیاز مالی خود به عاملان تأمین مالی جمعی مراجعه
            می‌کنند.
          </dd>
        </div>

        <div>
          <dt className="font-bold text-accent-600">سرمایه‌گذار:</dt>
          <dd>
            شخص حقیقی یا حقوقی که دارای منابع مالی بوده و با شناخت کافی از فرآیند تأمین مالی جمعی،
            این ابزار را به‌عنوان فرصتی برای سرمایه‌گذاری انتخاب می‌کند.
          </dd>
        </div>

        <div>
          <dt className="font-bold text-accent-600">سرمایه درخواستی:</dt>
          <dd>
            مبلغ مورد نیاز متقاضی سرمایه که در سکوی تأمین مالی جمعی منتشر شده و از طریق
            سرمایه‌گذاران واجد شرایط (دارای کد سجام) تأمین می‌شود. متقاضی سرمایه متعهد است که در
            دوره‌های زمانی سه‌ماهه سود پیش‌بینی‌شده را پرداخت کرده و در پایان دوره اصل سرمایه را
            بازگرداند.
          </dd>
        </div>

        <div>
          <dt className="font-bold text-accent-600">سود پیش‌بینی‌شده:</dt>
          <dd>میزان سودی که متقاضی سرمایه، پیش بینی می‌کند که سرمایه گذار پرداخت نماید</dd>
        </div>

        <div>
          <dt className="font-bold text-accent-600">گزارش ارزیابی جامع:</dt>
          <dd>
            در سکوی تأمین مالی جمعی لوتوس کراد، به دلیل اینکه شرکت تامین سرمایه لوتوس دارای مجوز
            تأمین مالی جمعی است و هم به عنوان نهادمالی فعال در بازار سرمایه فعالیت دارد، گزارشی تحت
            عنوان &rdquo;گزارش ارزیابی جامع&rdquo; تهیه می‌شود. این گزارش شامل ارزیابی متقاضی توسط
            عامل، پایش طرح توسط نهاد مالی، پیوست‌ها و ضمائم مرتبط است تا سرمایه‌گذاران با اطمینان
            بیشتری تصمیم‌گیری کنند.
          </dd>
        </div>

        <div>
          <dt className="font-bold text-accent-600">وثایق:</dt>
          <dd>
            متقاضی سرمایه برای دریافت منابع مالی، ملزم به ارائه ضمانت‌ها و وثایق مشخصی به عامل است.
            این ضمانت‌ها شامل ضمانت‌نامه بانکی پرداخت اصل سرمایه، ضمانت حسن انجام تعهدات از سوی
            صندوق‌های معتبر کشور، ضمانت شخص ثالث، چک و سفته متقاضی سرمایه است. تمامی این اسناد باید
            پیش از انتشار طرح در سکو، در اختیار عامل قرار گیرند.
          </dd>
        </div>

        <div>
          <dt className="font-bold text-accent-600">گزارش طرح توسعه:</dt>
          <p>
            متقاضی سرمایه موظف است گزارشی مبنی بر نیاز مالی کسب‌وکار خود تهیه کند. این گزارش شامل
            برآورد میزان درآمد و هزینه‌های آتی، نوع دقیق محصول یا خدمت ارائه‌شده و اهداف توسعه‌ای
            است. این سند برای بررسی و تأیید در اختیار عامل قرار می‌گیرد تا روند تأمین مالی به شکلی
            اصولی و شفاف انجام شود.
          </p>{' '}
        </div>
      </dl>
    </div>
  );
}

export default CrowdfundingKeywords;
