import React from 'react';
import disADandAD from 'asset/Pictures/Images/disADandAD.png';

function DisADandAD() {
  return (
    <div className="lg:w-[80%] w-[95%] flex flex-col items-center  justify-start  gap-y-6 p-5  text-gray-main text-base  ">
      <img src={disADandAD} className="lg:w-[70%] w-[90%] rounded-lg  object-contain " />
      <span className=" text-justify pt-5 "></span>
      <span className=" text-justify  ">
        سرمایه‌گذار و متقاضی سرمایه دو رکن بازار تامین مالی جمعی هستند که هردو به دارای مزایا و
        معایت متفاوتی نسبت به یکدیگر هستند حال در این مقاله به بررسی دقیق تر این موضوع خواهیم
        پرداخت:
      </span>
      <span className=" text-justify  ">
        مزایای سرمایه گذاری در طرح های تامین مالی جمعی : ازجمله مزایای تامین مالی جمعی برای
        سرمایه‌گذاران سرمایه گذاری با نرخ بیشتر از نرخ سپرده های بانک و صندوق‌های سرمایه گذاری در
        اوراق با درآمد ثابت می‌باشد باید در نظر داشت که وجود ریسک در این نوع سرمایه گذاری باعث تمایز
        این نوع سرمایه گذاری در از سایر سرمایه گذاری ها همچون صندوق‌های درآمد ثابت و سپرده بانکی
        گردیده است. از سایر مزایا آن میتوان به تضامین اصل سرمایه دریافتی از متقاضیان سرمایه اشاره
        نمود.
      </span>
      <span className=" text-justify  ">
        مزایای مختص متقاضیان سرمایه در تامین مالی جمعی: با توجه به سیاست‌های انقباضی بانک مرکزی و
        بازار پول درخصوص عدم تزریق منابع مالی به متقاضیان سرمایه شبکه ای از سکوهای تامین مالی جمعی و
        کاربران آنها حجم قابل توجهی از این نوع ارائه تسهیلات را برعهده گرفتند و این حجم از برآورده
        سازی نیاز مالی کسب و کار در نوع خود قابل توجه می‌باشد. از طرفی وجود تعدد زیاد سکوهای تامین
        مالی جمعی و ارائه مجوز سکو از شرکت فرابورس این امکان را به متقاضیان ارائه نموده علاوه بر
        رقابتی نمودن نرخ تامین مالی در کیفیت و مدت زمان تامین مالی رقابت ایجاد نموده است درخصوص
        معایب نیز هر آنچه که به عنوان ریسک این بازار مطرح می‌گردد به عنوان معایب و محدودیت‌های ای
        نوع تامین مالی یا ابزار سرمایه گذاری مطرح می‌گردد.
      </span>
    </div>
  );
}

export default DisADandAD;
