import React from 'react';
import liquidity from 'asset/Pictures/Images/liquidity.png';

function Liquidity() {
  return (
    <div className="lg:w-[80%] w-[95%] flex flex-col items-center  justify-start  gap-y-6 p-5  text-gray-main text-base  ">
      <img src={liquidity} className="lg:w-[70%] w-[90%] rounded-lg  object-contain " />
      <span className=" text-justify pt-5 ">
        Liquidity یا نقد شوندگی به معنای سرعت تبدیل یک دارایی به وجه نقد می‌باشد این عامل،یک عامل
        تصمیم ساز در همه سرمایه‌گذاری‌ها می‌باشد. نمونه بارز این تصمیم سازی را می‌توان در انتخاب
        سهام‌هایی در بازار سرمایه گرفت که این امکان را به سرمایه‌گذار می‌دهد تا حتی در صف فروش سهام
        مد نظر خود توانایی نقدنمودن سرمایه‌گذاری خود را داشته باشد. این موضوع در بازار تامین مالی
        جمعی به عنوان یک نوع سرمایه گذاری نیز مشهود است. با ذکر این نکته که در این نوع سرمایه‌گذاری
        با مواعد پرداخت سود پیش بینی شده در طی دوره سرمایه‌گذاری و بازپرداخت اصل سرمایه در انتهای
        دوره سرمایه‌گذاری عملا از نقدشوندگی زیادی برخوردار نیست و این عنصر به عنوان یکی از محدودیت
        های این نوع سرمایه‌گذاری محسوب می‌‌گردد. به عنوان مثال بازار ثانویه موجود برای سهام یا اوراق
        بهادار شرکت‌ها مزیتی را برای سرمایه‌گذاری و معامله این اوراق به وجود آورده که بازار تامین
        مالی جمعی از این مزیت برخوردار نیست، باید در نظر داشت که وجود بازار ثانویه برای هر ابزار
        سرمایه گذاری مزیتی همچون نقدشوندگی به وجود می‌آورد در حال حاضر بازار ثانویه‌برای تامین مالی
        جمعی وجود ندارد.
      </span>
    </div>
  );
}

export default Liquidity;
