import React from 'react';
import know from 'asset/Pictures/Images/Thingknow.png';
import { useNavigate } from 'react-router-dom';

function ThingsToKnowAboutZagrosKrad() {
  const navigate = useNavigate();

  return (
    <div
      dir="rtl"
      className=" text-right p-6 flex flex-col items-center  space-y-6 bg-white text-gray-800 leading-loose mt-28 py-10 w-full max-w-[1440px]  rounded-large  drop-shadow-md ">
      <div className="w-[95%] flex  justify-end items-center pt-5">
        {' '}
        <button
          onClick={() => navigate(-1)}
          className="drop-shadow-md rounded-md p-2  bg-white hover:border border-accent-300 ">
          {' '}
          بازگشت
        </button>
      </div>
      <h1 className="text-2xl font-bold text-accent-700">دانستنی ها در زاگرس کراد</h1>

      <img src={know} className="w-[90%] object-contain h-[300px]" />
      <section className="space-y-4 w-[95%]">
        <h2 className="text-lg font-semibold text-accent-600">
          - سرمایه گذاری در تامین مالی جمعی چگونه انجام می‌‍شود؟{' '}
        </h2>
        <p>
          باید در نظر داشت که سرمایه گذاری همواره دارای ریسک می باشد و ریسک این نوع سرمایه گذاری با
          سایر سرمایه گذاری ها متفاوت است باید در نظر داشت که سرمایه گذاران منابع مالی خود را به
          عنوان شراکت در اختیار شرکت‌ها قرارداده و شرکت‌ها با تامین نیاز مالی خود از منابع سرمایه
          گذاران سعی در بازپرداخت سود پیش بینی شده به صورت هر سه ماه یکبار و بازپرداخت اصل سرمایه در
          انتهای یکسال می باشد، با این اوصاف منابع سرمایه گذاران در معرض ریسک های بازارها و صنعت‌ها
          به صورت عملیاتی قرار خواهد گرفت و نرخ بازده پیش بینی شده مورد انتشار سرمایه گذاران توسط
          این عوامل افزایش می‌یابد.
        </p>

        <h2 className="text-lg font-semibold text-accent-600">
          - نقش حسابرسان در تامین مالی جمعی چیست؟{' '}
        </h2>
        <p>
          حسابرسان در بازار تامین مالی جمعی نقشی کلیدی و حساسی را بعد از عامل و نهادمالی اجرا
          مینمایند . در بازار تامین مالی جمعی گاها طرح هایی وجود دارد که متقاضیان سرمایه آن از
          موسسات حسابرسی معتمد سازمان بورس استفاده مینمایند این بدان معناست که موسسان حسابرسی معتمد
          سازمان بورس با رعایت کیفیت افشا موارد صورتهای مالی حسابرسی شده شفافیت بیشتری را برای
          ذینفعان صورت مالی به همراه دارد.موسسان حسابرسی در خصوص طرح های تامین مالی سکوها جهت تسویه
          در انتهای دوره سرمایه گذاری گزارش حسابرسی شده از درآمد ها و هزینه های طرح به عامل تسلیم
          مینماید و این گزارش مبنای تسویه سود پیش بینی شده حاصل از سرمایه گذاری بر روی طرح های تامین
          مالی جمعی در سکوها می باشد.
        </p>

        <h2 className="text-lg font-semibold text-accent-600">- نقش تضامین در تامین مالی جمعی؟</h2>
        <p>
          با توجه به ریسک این نوع سرمایه گذاری متقاضیان سرمایه جهت اطمینان بخشیدن به سرمایه گذاران
          جذب منابع مورد نیاز با ارائه قرارداد تامین مالی جمعی به میزان اصل سرمایه درخواست شده از
          مجاری معتبر ضمانتها و یا وثایقی را دریافت مینمایند و آن را به سکو به عنوان وکیل و نماینده
          سرمایه گذاران ارائه میدهد. این تضامین، سعی در پوشش ریسک در خصوص اصل سرمایه را دارد و بنا
          به اعتبارشان طبقه بندی خواهد شد.
        </p>
        <h2 className="text-lg font-semibold text-accent-600">
          - رتبه بندی اعتباری تضامین در تامین مالی جمعی چگونه است؟{' '}
        </h2>
        <p>ضمانت ها و وثایق در بازار تامین مالی جمعی به تقسیم بندی زیر تقسیم می‌گردد:</p>
        <ul className=" pr-3 space-y-2 font-Yekan">
          <li>
            <strong className="text-accent-600">1)</strong> توثیق سهام : یکی از نقد شونده‌ترین ضمانت
            های موجود در سکوهای تامین مالی جمعی یوده که تنهااصل مبلغ سرمایه‌گذاری را تضمین می‌نماید
          </li>
          <li>
            <strong className="text-accent-600">2)</strong> ضمانت تعهد پرداخت اصل سرمایه : این ضمانت
            از شبکه بانکی کشور تهیه میگردد و دارای بالاترین سطح تعهد در بین سایرین می باشد. در بازار
            تامین مالی جمعی اقبال برای سرمایه گذاری بر روی طرح هایی که این نوع ضمانت را دارند زیاد
            است. این تضامین ضمانت کننده اصل سرمایه هستند.
          </li>
          <li>
            <strong className="text-accent-600">3)</strong> ضمانت حسن انجام کار: این ضمانت ها در
            زمانی ارائه میگردد که متقاضی سرمایه عضو یکی از صندوق های تحت نظارت نهاد ریاست جمهوری و
            یا صندوق های صنفی باشند این صندوق در زمان عضویت کسب و کار به اعضای خود ضمانتی با این
            عنوان اعطا می‌نمایند تا در قراردادها و از ضمانتها استفاده نمایند
          </li>
          <li>
            <strong className="text-accent-600">4)</strong> ضمانت شخص ثالث : این ضمانت در صورتی
            انتخاب میگردد که متقاضی سرمایه دارایی مناسبی جهت وثیقه قراردادن نداشته و به دنبال تامین
            نیاز خود از بازار تامین مالی جمعی سعی در وثیقه قراردادن دارایی های مالی خود و سایر اشخاص
            را دارد. این نوع وثیقه گذاری به با رتبه اعتباری ضعیف یکی از انواع ضمانت ها می باشد.
          </li>
          <li>
            <strong className="text-accent-600">5)</strong> چک و سفته : این تضامین اصل سرمایه سرمایه
            گذاران را نیز تضمین نمی‌کند.
          </li>
        </ul>

        <h2 className="text-lg font-semibold text-accent-600">
          نهادهای مالی ناظر عملیات سکوهای تامین مالی جمعی:{' '}
        </h2>
        <p>
          با توجه به تصمیم کارگروه ارزیابی در تهیه و تنظیم دستورالعمل تامین مالی جمعی،بنا به رصد
          عملیات سکوی تامین مالی جمعی مبنی بر پایش تمامی فعالیت های سکوهای تامین مالی جمعی نهاد مالی
          را ناظر بر عملیات سکو های تامین مالی جمعی قرار داده است که وظیفه بررسی مستندات و گزارشات و
          اعتبارسنجی متقاضیان سرمایه که توسط سکوها به نهادمالی ارجاع داده می‌شود اظهار نظر می‌نمایدو
          نهاد مالی ناظر بر سکوهای تامین مالی جمعی از نهادهای مالی فعال در بازار سرمایه بوده است.
        </p>
        <h2 className="text-lg font-semibold text-accent-600">- ارزیابی اولیه متقاضی سرمایه:</h2>
        <p>
          سکوی تامین مالی موظف است که متقاضیانی را برای سرمایه گذاری در درگاه خود قراردهد که شرایط
          مناسبی جهت تامین مالی و برطرف نمودن نیاز مالی خود داشته باشند. بنابراین انتخاب متقاضی
          سرمایه واجد شرایط مستلزم برگزاری کمیته های سرمایه گذاری و ایجاد بحث و بررسی های فنی در
          خصوص تامین مالی متقاضیان سرمایه در سکو می‌باشد.{' '}
        </p>

        <h2 className="text-lg font-semibold text-accent-600">- کد سجامی در تامین مالی جمعی:</h2>
        <p>
          سرمایه گذاران محترم باید در نظر داشته باشند که جهت سرمایه گذاری در این بازار باید پس از
          ثبت‌نام و ایجاد پروفایل احراز هویت سجامی خود را انجام دهندو متقاضیان سرمایه نیز جهت تامین
          مالی از این بازار باید کد سجامی خود را قبل از شروع به فرایند های تامین مالی از ابن بازار
          انجام دهد.
        </p>
        <h2 className="text-lg font-semibold text-accent-600">
          - تفاوت سرمایه گذاری اشخاص حقیقی و حقوقی:
        </h2>
        <p>
          حداکثر میزان سرمایه گذاری برای اشخاص حقیقی 5درصد میزان سرمایه درخواستی متقاضی سرمایه می
          باشد و حداکثر میزان سرمایه گذاری برای اشخاص حقوقی به میزان 100درصد سرمایه درخواستی متقاضی
          می باشد.
        </p>

        <h2 className="text-lg font-semibold text-accent-600">- گواهی شراکت در تامین مالی جمعی:</h2>
        <p>
          شرکت فرابورس ایران به عنوان سازمان قانون‌گذار تامین مالی جمعی جهت اثبات مشارکت سرمایه
          گذاران در طرح‌های تامین مالی جمعی سکوی‌های فعال در این حوزه، گواهی شراکت پس از واریز وجوه
          به متقاضی برای سرمایه گذاران صادر می‌نماید. این اوراق ازجمله اوراق بهادار سازمان بورس می
          باشد.
        </p>
      </section>
    </div>
  );
}

export default ThingsToKnowAboutZagrosKrad;
